<a href="https://colab.research.google.com/github/DuplamenteH/Ds/blob/master/DS_Project2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Importando dados

In [0]:
import pandas as pd

In [2]:

data = pd.read_csv('drive/My Drive/DadosAlura/aluguel.csv', sep=';')
data.head()

          Tipo               Bairro  Quartos  ...  IPTU  Valor m2  Tipo Agregado
0  Apartamento               Centro        1  ...  20.0     53.33    Apartamento
1  Apartamento         Higienópolis        1  ...   0.0     16.67    Apartamento
2  Apartamento             Cachambi        2  ...  17.0     26.00    Apartamento
3  Apartamento               Grajaú        2  ...  74.0     21.43    Apartamento
4  Apartamento  Lins de Vasconcelos        3  ...  14.0     16.67    Apartamento

[5 rows x 11 columns]

In [3]:
data.tail()

            Tipo      Bairro  Quartos  ...   IPTU  Valor m2  Tipo Agregado
19826  Quitinete      Glória        1  ...   10.0     40.00    Apartamento
19827  Quitinete    Flamengo        1  ...    0.0     39.13    Apartamento
19828  Quitinete      Centro        1  ...    0.0     45.83    Apartamento
19829  Quitinete  Copacabana        1  ...  200.0     68.18    Apartamento
19830  Quitinete      Centro        0  ...   25.0     29.63    Apartamento

[5 rows x 11 columns]

#Informações gerais sobre o banco de dados

In [4]:
data.dtypes

Tipo              object
Bairro            object
Quartos            int64
Vagas              int64
Suites             int64
Area               int64
Valor            float64
Condominio       float64
IPTU             float64
Valor m2         float64
Tipo Agregado     object
dtype: object

In [5]:
tipo_dados= pd.DataFrame(data.dtypes, columns=['Tipos de dados'])
tipo_dados

              Tipos de dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [6]:
tipo_dados.columns.name='Variaveis'
tipo_dados

Variaveis     Tipos de dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [7]:
print('A base de dados apresenta {} registros imóveis e {} variáveis'.format(data.shape[0], data.shape[1]))

A base de dados apresenta 19831 registros imóveis e 11 variáveis

#Extras

##Lendo arquivos JSON

In [8]:
df_json= pd.read_json('drive/My Drive/DadosAlura/aluguel.json')
df_json.head()

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN

[5 rows x 9 columns]

##Lendo arquivos HTML

In [9]:
path = 'drive/My Drive/DadosAlura/'
html = pd.read_html(path+'dados_html_1.html')
df_html=html[0]
df_html

  FAIXA ETÁRIA UNAFISCO SAÚDE SOFT II SOFT PARTICIPATIVO      UNIQUE
0      00 A 18               R$218,99           R$192,60    R$334,48
1      19 A 23               R$263,63           R$207,67    R$380,06
2      24 A 28               R$322,44           R$224,26    R$464,39
3      29 A 33               R$402,05           R$258,63    R$566,68
4      34 A 38               R$455,17           R$306,37    R$664,61
5      39 A 43               R$489,29           R$417,93    R$742,72
6      44 A 48               R$582,65           R$495,24    R$869,47
7      49 A 53               R$718,86           R$562,64  R$1.046,29
8      54 A 58               R$908,54           R$721,00  R$1.355,74
9   59 OU MAIS             R$1.244,50         R$1.151,62  R$2.003,53

##Lendo arquivos Excel

In [10]:
df_xlsx = pd.read_excel(path+'aluguel.xlsx')
df_xlsx

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN
5              Apartamento     Vista Alegre        3  ...   1200         NaN     NaN
6              Apartamento         Cachambi        2  ...   1300       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca        5  ...  22000         NaN     NaN
8       Casa de Condomínio            Ramos        2  ...   1000         NaN     NaN
9  Conjunto Comercial/Sala           Centro        0  ...  35000     19193.0  3030.0

[10 rows x 9 columns]

##Lendo arquivos txt

In [11]:
df_txt = pd.read_table(path+'aluguel.txt')
df_txt

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN
5              Apartamento     Vista Alegre        3  ...   1200         NaN     NaN
6              Apartamento         Cachambi        2  ...   1300       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca        5  ...  22000         NaN     NaN
8       Casa de Condomínio            Ramos        2  ...   1000         NaN     NaN
9  Conjunto Comercial/Sala           Centro        0  ...  35000     19193.0  3030.0

[10 rows x 9 columns]

# Relatório de Análise II

## Tipos de Imóveis

In [12]:
tipo_de_imoveis  = data['Tipo']
tipo_de_imoveis.dtype

dtype('O')

In [13]:
tipo_de_imoveis

0        Apartamento
1        Apartamento
2        Apartamento
3        Apartamento
4        Apartamento
            ...
19826      Quitinete
19827      Quitinete
19828      Quitinete
19829      Quitinete
19830      Quitinete
Name: Tipo, Length: 19831, dtype: object

In [0]:
tipo_de_imoveis.drop_duplicates(inplace=True)

In [15]:
tipo_de_imoveis

0               Apartamento
16923                  Casa
17821    Casa de Condomínio
18785          Casa de Vila
19018             Quitinete
Name: Tipo, dtype: object

## Organizando Visualização

In [0]:
tipo_de_imovel = pd.DataFrame(tipo_de_imoveis)

In [17]:
tipo_de_imovel

                     Tipo
0             Apartamento
16923                Casa
17821  Casa de Condomínio
18785        Casa de Vila
19018           Quitinete

In [0]:
tipo_de_imovel.index = range(tipo_de_imovel.shape[0])

In [19]:
tipo_de_imovel.columns.name = 'id'
tipo_de_imovel

id                Tipo
0          Apartamento
1                 Casa
2   Casa de Condomínio
3         Casa de Vila
4            Quitinete

#Relatorio de analies III

In [20]:
data.head(10)

          Tipo                   Bairro  Quartos  ...   IPTU  Valor m2  Tipo Agregado
0  Apartamento                   Centro        1  ...   20.0     53.33    Apartamento
1  Apartamento             Higienópolis        1  ...    0.0     16.67    Apartamento
2  Apartamento                 Cachambi        2  ...   17.0     26.00    Apartamento
3  Apartamento                   Grajaú        2  ...   74.0     21.43    Apartamento
4  Apartamento      Lins de Vasconcelos        3  ...   14.0     16.67    Apartamento
5  Apartamento               Copacabana        1  ...   50.0     50.00    Apartamento
6  Apartamento  Freguesia (Jacarepaguá)        3  ...   28.0     17.59    Apartamento
7  Apartamento          Barra da Tijuca        2  ...  147.0     25.37    Apartamento
8  Apartamento                   Tijuca        2  ...  138.0     17.27    Apartamento
9  Apartamento                   Olaria        3  ...    0.0     14.71    Apartamento

[10 rows x 11 columns]

In [21]:
list(data['Tipo'].drop_duplicates())

['Apartamento', 'Casa', 'Casa de Condomínio', 'Casa de Vila', 'Quitinete']

In [0]:
residencial = ['Apartamento', 'Casa', 'Casa de Condomínio', 'Casa de Vila', 'Quitinete']